nxp-mcuxpresso/mcux-soc-svd/MCXN556T/MCXN556T_cm33_core0.xml
        <register>
          <name>ELS_AS_ST1</name>
          <description>ELS AS State1</description>
          <addressOffset>0x9E4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x5024F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_QK_PUF_SCORE</name>
              <description>These register bits indicate the state of &quot;qk_puf_score[3:0]&quot; outputs from QK PUF block</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_QK_ZEROIZED</name>
              <description>This register bit indicates the state of &quot;qk_zeroized&quot; output from QK PUF block</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_MAIN_CLK_IS_EXT</name>
              <description>When MAIN_CLK is running from external clock source either XO32M, XO32K or GPIO CLKIN, this bit indicates state 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_DCDC_VOUT</name>
              <description>VOUT[1:0] setting on DCDC0 register in SPC block will reflect to this register. Default is 1.0V</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_DCDC_DS</name>
              <description>DCDC drive strength setting. Default is normal drive.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_BOOT_MODE</name>
              <description>ISP pin status during boot. By default ISP pin is pulled up. If want to enter ISP mode during boot, ISP pin should be pull down when out of reset.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_BOOT_RETRY_CNT</name>
              <description>BOOT_RETRY_CNT[3:0] in the ELS_BOOT_RETRY_CNT register reflects this register</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_LDO_CORE_VOUT</name>
              <description>VOUT[1:0] setting on LDO Core register in SPC block will reflect to this register. Default is 1.0V</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_LDO_CORE_DS</name>
              <description>LDO_CORE drive strength setting. Default is normal drive.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_BOOT_LOG0</name>
          <description>Boot state captured during boot: Main ROM log</description>
          <addressOffset>0x9E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOT_IMAGE</name>
              <description>Boot image source used during this boot.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM0</name>
                  <description>Internal flash image 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM1</name>
                  <description>Internal flash image 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM2</name>
                  <description>FlexSPI flash image 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM3</name>
                  <description>FlexSPI flash image 1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM4</name>
                  <description>Recovery SPI flash image</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM5</name>
                  <description>Serial boot image (write-memory and execute ISP command used)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM6</name>
                  <description>Receive SB3 containing SB_JUMP command is used.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM7</name>
                  <description>Customer SBL/recovery image (Bank1 IFR0).</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM8</name>
                  <description>NXP MAD recovery image (Bank1 IFR0).</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM9</name>
                  <description>NXP ROM extension (NMPA - Bank0 IFR0).</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMAC</name>
              <description>CMAC verify is used instead of ECDSA verify on this boot.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECDSA</name>
              <description>ECDSA P-384 verification is done on this boot.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OFF_CHIP</name>
              <description>Off-chip Prince is enabled during boot.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ON_CHIP</name>
              <description>On-chip Prince is enabled during boot.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CDI_CSR</name>
              <description>CDI based device keys are derived for CSR harvesting on this boot.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CDI_DICE</name>
              <description>CDI per DICE specification is computed on this boot.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRUSTZONE</name>
              <description>TrustZone preset data is loaded during this boot.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEBUG_AUTH</name>
              <description>Debug authentication done in this session prior to boot.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ITRC</name>
              <description>ITRC zeroize event is handled in this session of boot.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIG_GDET</name>
              <description>Digital glitch detector is enabled during boot.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANA_GDET</name>
              <description>Analog glitch detector is enabled during boot.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEEP_PD</name>
              <description>Boot from deep-power down state.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOW_POWER</name>
              <description>Last low-power mode value. ROM copies SPC_LP_MODE field from SPC-&gt;SC[7:4].</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISP</name>
              <description>ISP pin state at boot time. ROM copies CMC-&gt;MR0[0].</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_BOOT_LOG1</name>
          <description>Boot state captured during boot: Library log</description>
          <addressOffset>0x9EC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RoTK</name>
              <description>RoTK index used for this boot.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIPS</name>
              <description>FIPS self-test is executed and PASS during this boot. When a bit is set, means self-test is executed and it FAILS. When a bit is clear, means corresponding self-test is executed and PASS or it is not executed.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SB3</name>
              <description>SB3 type (valid after nboot_sb3_load_manifest()).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CUSTOMER</name>
                  <description>customer fw load/update file.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NXP</name>
                  <description>NXP Provisioning FW.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OEM</name>
                  <description>ELS signed OEM Provisioning FW.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_BOOT_LOG2</name>
          <description>Boot state captured during boot: Hardware status signals log</description>
          <addressOffset>0x9F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMC_SRS0</name>
              <description>CMC-&gt;SRS[5:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VBAT_STATUS0</name>
              <description>VBAT-&gt;STATUSA[1:0] | ~VBAT-&gt;STATUSB[1:0]</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMC_SRS1</name>
              <description>CMC-&gt;SRS[16:8]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VBAT_STATUS1</name>
              <description>VBAT-&gt;STATUSA[11:6] | ~VBAT-&gt;STATUSB[11:6]</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMC_SRS2</name>
              <description>CMC-&gt;SRS[31:24]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_BOOT_LOG3</name>
          <description>Boot state captured during boot: Security log</description>
          <addressOffset>0x9F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERR_AUTH_FAIL_COUNT</name>
              <description>CFPA-&gt;ERR_AUTH_FAIL_COUNT[7:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_ITRC_COUNT</name>
              <description>CFPA-&gt;ERR_ITRC_COUNT[7:0]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
