nxp-mcuxpresso/mcux-soc-svd/MCXN556T/MCXN556T_cm33_core0.xml
        <register>
          <name>MAC_HW_FEATURE2</name>
          <description>Hardware Features 2</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x41041</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXQCNT</name>
              <description>Number of MTL Receive Queues</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_1RXQ</name>
                  <description>1 MTL Rx Queue</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_2RXQ</name>
                  <description>2 MTL Rx Queues</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_3RXQ</name>
                  <description>3 MTL Rx Queues</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_4RXQ</name>
                  <description>4 MTL Rx Queues</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_5RXQ</name>
                  <description>5 MTL Rx Queues</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_6RXQ</name>
                  <description>6 MTL Rx Queues</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_7RXQ</name>
                  <description>7 MTL Rx Queues</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_8RXQ</name>
                  <description>8 MTL Rx Queues</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXQCNT</name>
              <description>Number of MTL Transmit Queues</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_1TXQ</name>
                  <description>1 MTL Tx Queue</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_2TXQ</name>
                  <description>2 MTL Tx Queues</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_3TXQ</name>
                  <description>3 MTL Tx Queues</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_4TXQ</name>
                  <description>4 MTL Tx Queues</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_5TXQ</name>
                  <description>5 MTL Tx Queues</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_6TXQ</name>
                  <description>6 MTL Tx Queues</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_7TXQ</name>
                  <description>7 MTL Tx Queues</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_8TXQ</name>
                  <description>8 MTL Tx Queues</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXCHCNT</name>
              <description>Number of DMA Receive Channels</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_1RXCH</name>
                  <description>1 MTL Rx Channel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_2RXCH</name>
                  <description>2 MTL Rx Channels</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_3RXCH</name>
                  <description>3 MTL Rx Channels</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_4RXCH</name>
                  <description>4 MTL Rx Channels</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_5RXCH</name>
                  <description>5 MTL Rx Channels</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_6RXCH</name>
                  <description>6 MTL Rx Channels</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_7RXCH</name>
                  <description>7 MTL Rx Channels</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_8RXCH</name>
                  <description>8 MTL Rx Channels</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDCSZ</name>
              <description>Rx DMA Descriptor Cache Size in terms of 16 bytes descriptors:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXCHCNT</name>
              <description>Number of DMA Transmit Channels</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_1TXCH</name>
                  <description>1 MTL Tx Channel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_2TXCH</name>
                  <description>2 MTL Tx Channels</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_3TXCH</name>
                  <description>3 MTL Tx Channels</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_4TXCH</name>
                  <description>4 MTL Tx Channels</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_5TXCH</name>
                  <description>5 MTL Tx Channels</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_6TXCH</name>
                  <description>6 MTL Tx Channels</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_7TXCH</name>
                  <description>7 MTL Tx Channels</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_8TXCH</name>
                  <description>8 MTL Tx Channels</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDCSZ</name>
              <description>Tx DMA Descriptor Cache Size in terms of 16 bytes descriptors:</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PPSOUTNUM</name>
              <description>Number of PPS Outputs</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PPSO</name>
                  <description>No PPS output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_1_PPSO</name>
                  <description>1 PPS output</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_2_PPSO</name>
                  <description>2 PPS output</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_3_PPSO</name>
                  <description>3 PPS output</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_4_PPSO</name>
                  <description>4 PPS output</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUXSNAPNUM</name>
              <description>Number of Auxiliary Snapshot Inputs</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_AUXI</name>
                  <description>No auxiliary input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_1_AUXI</name>
                  <description>1 auxiliary input</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_2_AUXI</name>
                  <description>2 auxiliary input</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_3_AUXI</name>
                  <description>3 auxiliary input</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_4_AUXI</name>
                  <description>4 auxiliary input</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
